import asyncio

import random

from AnonXMusic import app

from pyrogram.types import (InlineKeyboardButton,

                            InlineKeyboardMarkup, Message)


from pyrogram import filters, Client





txt = [

"<b> ‏إنّها الحياة!! لم نأخذ منها عهداً أن تكون ضاحكةً لنا على الدوام ، فهي تُقَدِّم لنا أثمن دروسها على طبَقٍ من ألم ، ولكل شيءٍ ثمينٍ فيها ثمن..!🤍📚</b>", 
"<b>  عِجافُ الأيَّامِ يَعقِّبُها يَومُ الغَوثِ وَ إن طَالت .   </b>",  
"<b> فلو خَلُص الإنسان من وهمه، لخلُص من همّه.    </b>",  
"<b> - أريد أن أكون معك بهذه البساطة وهذا التعقيد. _______وأنا عِن ألَف حبُ اكتفِيت فيكَ وحدكَ.</b>",  
"<b>   🖤ياليتهم قبل الرحيل تريثوا....       حتى نعانق أو نقول وداعا🖤  </b>",  
"<b>  لعمركَ ما الأبصارُ تنفعُ أهلَــــــــها إذا لم يكنْ للمُبْصِرينَ بَصَائِرُ🌸   </b>",  
"<b>    الّذي يُسلِّم أمرهُ لله، لا يرىٰ شيئًا بعيدًا🤲 </b>",  
"<b>   الانسحاب من الفوضى لا يقدر بثمن  </b>",  
"<b>    كل مـؤذي سـيؤذى إنها آلأيآم 🩶🕑 </b>",  
"<b>  ياربّ إني مُحسن الظن في تدبيرك فتولّني 🍂🤎   </b>",  
"<b>  اساند نفسي دائما لا أدين لاحد بشيء♡&   </b>",  
"<b>    تمادينا بالتفكير ونسينا بأن الاقدار مكتوبة♡ </b>",  
"<b>   اللهُم أبعد عنا كُل ما يخطف ضحكاتنا ويؤذي قلوبنا.  </b>",  


        ]


        


@app.on_message(filters.command(["حكمة","حكمه","✨حكمه"], ""))

async def ktbat(client: Client, message: Message):

      a = random.choice(txt)

      await message.reply(

        f"{a}")
