import asyncio

import random

from AnonXMusic import app

from pyrogram.types import (InlineKeyboardButton,

                            InlineKeyboardMarkup, Message)


from pyrogram import filters, Client





txt = [

"<b> ‏لا تستسلم، فالأشياء العظيمة لا تأتي بسهولة 🖇🖤 </b>", 
"<b> ‏الحياة ليست مجرد التنفس، بل اللحظات التي تأخذ أنفاسنا. </b>",  
"<b> ‏القراءة تجعل الإنسان كاملًا، والكتب هي أصدق الأصدقاء. </b>",  
"<b>الصداقة هي زهرة لا تتساقط أوراقها إلا عندما ينقطع جذورها. ‏ </b>",  
"<b> ‏العلم لا يعرف حدوداً، ومن يبحث عن المعرفة يجد طريقه. </b>",  
"<b> ‏التعليم هو أساس التقدم في المجتمع. </b>",  
"<b>الشمس ستشرق وسنحاول مجدداً 🖇🖤 ‏ </b>",  
"<b> ‏لا تُخبر النّاس عن خططك، أرِهم نتائجك🖇🖤 </b>",  
"<b> ‏كن قوياً في اللحظات التي يريد الجميع أن تڪون فيها ضعيفاً 🖤🖇 </b>",  
"<b> ‏الآمالُ العظيمة تتطلب جهوداً عظيمة 🖤🖇 </b>",  
"<b>التعليم هو سلاح الفقراء ومفتاح الأغنياء. ‏ </b>",  
"<b> ‏حيـن تملـئُ عقلـكَ بالافـكـارِ الإيجـابيـة، ستبـدأُ حيـاتـكَ بالتـغـيـر🖤🖇  </b>",  
"<b> ‏ الأيام الصعبة تقويك🖤🖇</b>",  
"<b> ‏قل للطريق الصعب سنبلغُ بالله ما مانريد 🖤🖇 </b>",  
"<b>أفعل ما يجعلك سعيداً 🖤🖇 ‏ </b>",  
"<b> ‏ لاتقلق بشأن مايفكر به الآخرين ركز في نفسك وكن ايجابيا 🖇🖤</b>",  
"<b> ‏احذف الفشل من قائمة خياراتك . </b>",  
"<b> سر النجاح هو في إكمال المهمة حتى النهاية .  ‏ </b>",  
"<b>من يريد النجاح يحاول🖤🖇 ‏ </b>",  
"<b>لا تستسلم، فالأشياء العظيمة لا تأتي بسهولة 🖇🖤 ‏ </b>",  
"<b> ‏الحياة ليست مجرد التنفس، بل اللحظات التي تأخذ أنفاسنا. </b>",  

        ]


        


@app.on_message(filters.command(["انصحني","ن","✨انصحني"], ""))

async def ktbat(client: Client, message: Message):

      a = random.choice(txt)

      await message.reply(

        f"{a}")
